Revit 2026 API

# WireConduitTypeSetErase Method

---

Removes a specified conduit type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	WireConduitType item
)
```
```vb
Public Overridable Function Erase (
	item As WireConduitType
) As Integer
```
```cpp
public:
virtual int Erase(
	WireConduitType^ item
)
```
```fsharp
abstract Erase :
        item : WireConduitType -> int
override Erase :
        item : WireConduitType -> int
```

#### Parameters

item WireConduitType
    The conduit type to be erased.

#### Return Value

Int32The number of conduit types that were erased from the set.

#### Reference

WireConduitTypeSet Class

Autodesk.Revit.DB.Electrical Namespace